// src/data/COC_items.js

export const COC_modules = [
  {
    id: 1,
    title: "科纳猎人",
    author: "星曦、秀林生",
    description: "第二世界-科纳系列-新手村",
    estimatedTime: "7-11小时",
    authorWords:
      `龙虎早已下山去，今日请君梦里来。`,
    background:
      `这是一个设定于当代欧洲的模组，事情发生于法国尼斯周边的海边小岛，著名旅游景点--科纳。小岛地理环境孤悬海外，有一大半的面积被森林覆盖。你们在岛上的行程定于2019年8月12至2019年8月17。当地原则上禁止外来者携带枪支和热武器。
      玩家到科纳的理由，可以是科考可以是旅游（最近的旅游价格很便宜），但是需要通过每周一五的轮渡来到小岛。刚下火车来到尼斯镇上，由提前联系的司机“丹”负责送往渡轮码头。
    `,
    requirements:
    {
      weapon: "最大伤害10；原则上小岛不可以携带热武器。",
      build: "购点540",
    },
    tags: ["COC", "模组", "第二世界", "新手村", "科纳系列"],
    year: 2019
  },
  {
    id: 2,
    title: "热情富勒姆",
    author: "星曦、秀林生",
    description: "第二世界-科纳系列2",
    estimatedTime: "5-8小时",
    authorWords:
      `三丈红炎由善念，九瓣红莲结苦果。`,
    background:
      `2004年的9月5日，你正坐在一辆前往达拉斯的长途巴士上。虽然已经入秋，但是秋老虎的余威却依旧笼罩着德州。今天的天气却更是变本加厉，异常地炎热，竟似乎比炎炎夏日还热了几分。当你们乘坐的巴士顶着烈日在一条偏僻的高速公路上行驶了几个小时之后，却忽然随着“吱呀”的一响停了下来。司机确认了这起半路抛锚的严重性后查了查地图，说附近只有这一个叫做富勒姆的村庄，带领着大家前往歇脚。没有任何信号。
      `,
    requirements:
    {
      weapon: "最多一把热武器，单次伤害小于等于10。多件武器则最大伤害之和小于等于12，单件小于等于6。可合理带上大巴。",
      build: "购点530",
    },
    tags: ["COC", "模组", "第二世界", "科纳系列"],
    year: 2004
  },
  {
    id: 3,
    title: "素雪赤心",
    author: "星曦、秀林生",
    description: "第二世界-科纳系列3",
    estimatedTime: "10-14小时",
    authorWords:
      `旧日故友此刻敌，今时小生他日神。`,
    background:
      `2013年11月30日，俄罗斯新西伯利亚市郊外的一场雪崩压垮了公路，使得小镇卡克哈夫斯基与外界只剩下了火车这一种联系。卡克哈夫斯基人口稀少，工业也并不发达。你看了看天气预报，似乎还有一场大雪即将来临。你抬头望向天空，却见到了一片血红色的雪花缓缓飘落，而远处的阴云中也在孕育着闪电的火花……
      `,
    requirements:
    {
      weapon: "最多一把热武器，单次伤害小于等于10。多件武器则最大伤害之和小于等于12",
      build: "购点530",
    },
    tags: ["COC", "模组", "第二世界", "科纳系列", "东亚"],
    special: [
        "作者建议：图书馆使用、意志、中文"
      ],
    year: 2013
  },
  {
    id: 4,
    title: "嵌在钢铁中的幽灵",
    author: "秀林生、狸十二",
    description: "第三世界-钢铁联盟-等级1",
    estimatedTime: "6-10小时",
    authorWords:
      `一位审判委员会的审判员结束一天的工作，回到办公室，突然独自大笑起来。
    对面办公桌的同事奇怪的问道：“有什么好笑的事吗？”
    “是啊，”审判员用手帕擦着笑出来的眼泪：“一个很好笑的笑话……”
    “哦？说来听听？”
    “你疯了吗？！我刚判了说这笑话的家伙在西伯利亚的劳动营干十五年苦役！”`,
    background:
      `1703年，圣彼得堡由彼得大帝建立，是俄国对外开放的重要门户。城市以其西式建筑和宽阔的运河而闻名，被誉为“北方的威尼斯”，乃至一度成为了俄国的首都。在20世纪初期钢铁联盟成立后，圣彼得堡依旧是其重要的经济、文化、政治、军事、工业中心，保留着第二首都的崇高地位。
    在钢铁联盟的巅峰时期，其拥有强大的军事力量和严格的社会控制，经济和社会生活完全由国家计划和管理，以解放人类为己任，是欧亚大陆上最有影响力的人类政权。由于圣彼得堡地型险要，西临波罗的海，南通欧洲中心，北抵北欧雪境，一直是钢铁联盟对外战争中的重要桥头堡。在多次的深海战争、雪域战争、死灵战争中，圣彼得堡都发挥了重要的作用，赢得了“铁血之都”的美誉。
    不过在20世纪80年代中期，随着强硬派的领导人迪诺乐去世，钢铁联盟社会的紧张局势和经济的不稳定开始逐渐爆发。尽管迪诺乐的继任者尼斯特·耶罗伯推行了一定旨在缓解内部矛盾和提升经济效益的政治改革，但社会中积累的巨大压力却依旧难以释放。
    1990年的圣彼得堡依旧被宏伟的人类沙文主义建筑、繁忙的工业区和标准化的居民区所主宰。不过尽管表面上秩序井然，社会的动荡却在城市的黑暗角落里酝酿着不可名状的恐惧。在12月11日的深冬寒风中，你们所乘坐的大巴车缓缓驶入了这座铁血之都……
    `,
    requirements:
    {
      weapon: "最大伤害10；非军方/警方枪械伤害小于等于8。",
      build: "购点530",
      special: [
        "信用评级≤60",
        "钢铁联盟实行私有制计划经济，购买物品均有定量配额，每日消费在100卢布以上的部分因为要额外购买配额票，价格一律翻倍或更高",
        "初始拥有5~15点克苏鲁神话，初始SAN减少超过5点以上的数值"
      ]
    },
    tags: ["COC", "模组", "第三世界", "钢铁联盟", "等级1", "引入"],
    year: 1990
  },
  {
    id: 5,
    title: "小心易碎",
    author: "秀林生、狸十二",
    description: "第三世界-钢铁联盟-等级2",
    estimatedTime: "12小时",
    authorWords:
      `自由前线的匪徒试图劫持钢铁联盟的火车去天朝，结果在半路上就被一个英勇的农民当场制止。记者采访这个普通的农民何以如此勇敢，结果农民小声说：“同志啊，我偷偷带了两块牛肉在火车上，打算去莫斯科卖了，如果那混蛋带我们去天朝，这两块牛肉就不值钱了。”
`,
    background:
      `在钢铁联盟西北大管区圣彼得堡州卢加区的斯坦林斯克，重工业的轰鸣声日夜不歇，隐藏在厚重的乌云和肃杀的寒风中。这个位于圣彼得堡南面的小镇原本是繁忙的工业重地，镇上的炼钢厂和铁路枢纽支撑着区域的经济。然而，随着经济困境和政治不安定在各地滋生着暗流，许多工厂已经停工或半停工。镇上的居民过着简单却戒备的生活，偶尔有人路过旅馆或酒馆时，总能听到有人在低声讨论些关于改革和未来的看法——更多时候，则是讳莫如深的沉默。
      小镇依旧依赖铁路维持生命线。在这漫天雪花的季节，列车往往是为数不多与外界相连的途径。1992年12月3日，你乘坐的列车从圣彼得堡南站出发，将于黄昏时分抵达斯坦林斯克，在那里短暂地停留1个小时。车窗外的静谧中似乎隐藏着某种无形的重量，将所有的疲倦和孤独包裹在一片白茫茫的雪夜里。随着列车缓缓停靠，铁轨上的摩擦声回荡在寂静的小镇中。而你，也看着窗外不断倒退的景色渐渐停滞，定格在了这未知的寒冬之中……
      `,
    requirements:
    {
      weapon: "最大伤害10；非军方/警方枪械伤害小于等于8。",
      build: "购点530",
      special: [
        "信用评级≤60",
        "钢铁联盟实行私有制计划经济，购买物品均有定量配额，每日消费在100卢布以上的部分因为要额外购买配额票，价格一律翻倍或更高",
        "初始拥有5~15点克苏鲁神话，初始SAN减少超过5点以上的数值"
      ]
    },
    tags: ["COC", "模组", "第三世界", "钢铁联盟", "等级2"],
    year: 1992
  },
  {
    id: 6,
    title: "被暴露的封存物",
    author: "秀林生、狸十二",
    description: "第三世界-钢铁联盟-等级2",
    estimatedTime: "10小时",
    authorWords:
      `在某仓库的代表会议上将研究两个问题：加强仓库中货物的安全措施和建设全人类的梦想家园。在仓库中没有货物的情况下，代表们决定直接研究第二个问题。
      `,
    background:
      `斯坦林斯克，这座位于钢铁联盟西北大管区圣彼得堡州卢加区的工业小镇，早已失去了昔日的辉煌。破败的厂房和残旧的街道曾是斯坦林斯克的骄傲，如今却成了流浪汉与反抗者偶尔出没的角落，只得无声诉说着一个个曾经繁盛而如今萧条的故事。最近几周，小镇被一连串离奇的自杀案件笼罩在不安的阴影之下。据说，自杀者均被发现于离家数公里外的郊区，有的在废弃厂房内，有的倒在荒野中。传言纷纷，有人说他们被“什么东西”追赶，有人提到不祥的低语，还有人说这是死灵教会的诅咒重临。1993年8月14日，一个炎热但不失凉爽的夏日，你们路过了西北第152纺织厂的一个仓库。突然，一声刺耳的尖叫划破了寂静，你们的目光被吸引向仓库深处。灰暗的光线下，一具尸体倒在地上，双眼圆睁，嘴唇微张，仿佛死前经历了难以想象的恐怖……
      `,
    requirements:
    {
      weapon: "最大伤害10+2护甲；非军方/警方枪械伤害小于等于8。",
      build: "购点530",
      special: [
        "信用评级≤60",
        "钢铁联盟实行私有制计划经济，购买物品均有定量配额，每日消费在100卢布以上的部分因为要额外购买配额票，价格一律翻倍或更高",
        "初始拥有5~15点克苏鲁神话，初始SAN减少超过5点以上的数值"
      ]
    },
    tags: ["COC", "模组", "第三世界", "钢铁联盟", "等级2"],
    year: 1993
  },
  {
    id: 7,
    title: "请填写您的目的地",
    author: "秀林生、狸十二",
    description: "第三世界-钢铁联盟-等级3",
    estimatedTime: "9小时",
    authorWords:
      `钢铁联盟的领导人们乘坐火车出门。开着开着，火车突然停了。
      尼尔拉兹把头伸出车窗外，怒吼道：“立即发动车组人员义务劳动，修铁路直通人类主义，把不来的通通作为反人类的叛徒抓起来枪毙！”可是车没有动。
      阿提辛悄悄说道：“把车组人员放了，只要枪毙火车司机就好。”可是车还是没有动。
      迪诺乐严肃地接着说：“给火车司机恢复名誉！”车仍然没有动。
      耶罗伯挥舞着双手说：“同志们，不如拉上窗帘，坐在座位上自己摇动身体，做出列车还在前进的样子……”
      最后，一个路过的秃头沉思道：“嘿，我们何不把火车拆了，到有铁轨的地方再拼装起来。”`,
    background:
      `斯坦林斯克是钢铁联盟西北大管区圣彼得堡州卢加区的一座小镇，始建于19世纪中叶，因铁路的建设而兴起。小镇的早期经济依赖于手工艺和森林资源，后来在钢铁联盟的工业化浪潮中迅速发展为重要的重工业基地。尽管斯坦林斯克的辉煌已成过去，但在最近却又因为一则关于幽灵列车的传说而躁动了起来。据当地居民称，幽灵列车是一辆只在夜间出现的神秘火车，穿梭于废弃的铁路上，车窗中透出的幽绿色光芒如同鬼火一般。据说，曾有几个胆大的年轻人试图靠近幽灵列车，却再也没有回来……1995年10月6日夜间，幽灵列车却在一片迷雾中停在了斯坦林斯克火车站站台上……
      `,
    requirements:
    {
      weapon: "最大伤害10+4护甲；非军方/警方枪械伤害小于等于8。",
      build: "购点540",
      special: [
        "信用评级≤60",
        "钢铁联盟实行私有制计划经济，购买物品均有定量配额，每日消费在100卢布以上的部分因为要额外购买配额票，价格一律翻倍或更高",
        "初始拥有5~15点克苏鲁神话，初始SAN减少超过5点以上的数值",
        "强线索收集和推理，强行战斗难度极大"
      ]
    },
    tags: ["COC", "模组", "第三世界", "钢铁联盟", "等级3"],
    year: 1995
  },
  {
    id: 8,
    title: "消失的第8人",
    author: "狸十二、秀林生",
    description: "第三世界-钢铁联盟-等级1",
    estimatedTime: "",
    authorWords:
      `钢铁联盟人、天朝帝国人和大洋联邦人争论什么是最勇敢的人。
      天朝帝国人说：“举例来讲，我们会找出八辆汽车，而明知其中一辆没有刹车。我们抽签，每人搭一辆开山路。最后我们中的一个人会住院，而另外七个则会去看他。”
      “这不算什么。”大洋联邦人说，“我们会选八个女孩，而明知其中有一个有艾滋病。我们抽签，一人找一个女孩。最后我们中的一个人会住院，另外七个则会去看他。”
      钢铁联盟人说：“你们这都称不上是勇敢。我们会找八个人，而明知其中有一个告密者。我们会聚在公寓里讲一晚上政治笑话，然后七个人进了监狱，另外一个则会去审他们。”
      `,
    background:
      `自从国家审判委员会正式授权“搜魔人”出现在公众视野，自由前线与搜魔人之间的暗战便彻底浮出水面。城市的裂痕愈发明显。现在，走在街上，你永远无法确定身边这个人，是搜魔人的耳目，还是自由前线的支持者——而更危险的是，他们彼此也分不清。
      就在这样的风口浪尖上， 圣彼得堡十二区雷宾斯克街发生了一起震惊全城的离奇命案。
      1997年5月28日下午3点，阳光明晃晃地照在圣彼得堡的街头。一辆大巴正缓缓驶过雷宾斯克街22号公寓门前。突然，一声钝响打破了车内的死寂——一具老人尸体从天而降，狠狠砸在车顶，鲜血顺着挡风玻璃蜿蜒而下。
      死者是雷宾斯克街22号公寓的管理员：阿加塔·库兹涅佐娃，一个再普通不过的老太太。
      但这一天，她从天而降。
      作为案发当时公寓里仅有的6名住户，你们自然而然地出现在了警方的视野之中……
      `,
    requirements:
    {
      weapon: "最大伤害10；非军方/警方枪械伤害小于等于8。",
      build: "购点530",
      special: [
        "5或6人剧本杀秘密团；强推理",
        "必须车新卡，具体要求请私聊KP。"
      ]
    },
    tags: ["COC", "模组", "第三世界", "钢铁联盟", "等级2", "秘密团",  "PVP", "剧本杀"],
    year: 1997
  },
  {
    id: 10,
    title: "黄金之血",
    author: "秀林生",
    description: "第二世界-单篇",
    estimatedTime: "8-12小时",
    authorWords:
      `且逍遥，哪知谁是豪杰，谁是神仙，谁又是谁？`,
    background:
      `八百年前，一个名叫铁木真的男孩在蒙古高原上诞生。谁也不会想到，这个男孩的铁骑将会从这里开始，踏遍整个欧亚大陆。他被称为成吉思汗，而流着他血脉的子孙则被称为黄金家族。英雄逝去，帝国分崩，但关于成吉思汗和黄金家族的传说却从未止歇。1996年5月4日，一场突如其来的大地震使得蒙古国东戈壁省哈腾布拉格与中国包头市相交处一带变得极不安全。然而三天之后的5月7日夜里，你们依然冒着余震的风险，怀着自己的目的来到了这个位于哈腾布拉格境内小村庄。
      `,
    requirements:
    {
      weapon: "最多一把1d8以下的枪械或一把任意冷兵器。如果是从中国边境合法入境的，请想好如何解释你携带的武器。",
      build: "购点530",
      special: [
        "建议：意志、蒙古语和中文、神秘学、社交、骑术",
        "这个本有一些“秘密”，秘密是只属于你一个人的背景和目的，可以让游戏体验更有挑战性，也会获得更丰厚的回报。但同时也可能造成你与一些NPC甚至是玩家间更多的冲突。如果希望获得一个属于你的“秘密”，请私聊kp"
      ]
    },
    tags: ["COC", "模组", "第二世界", "东亚", "单篇", "秘密团"],
    year: 1996
  },
  {
    id: 11,
    title: "赤色圣人窟",
    author: "秀林生",
    description: "第二世界-文字秘密团-高棉系列",
    estimatedTime: "碎片化时间20小时+",
    authorWords:
      `圣人一日不尽死，大盗一世不可止。`,
    background:
      `元贞二年（1296年），蒙古帝国（元朝）的使者周达观奉命出使柬埔寨的吴哥王朝，并且作为礼物带去了珍贵的“三面佛像”，而这尊由黄金打造的佛像也从此作为国宝在柬埔寨流传了下来，代表着其对于中原势力的依附。
      1998年4月，随着灵魂核心人物的去世，曾经叱咤柬埔寨的红色高棉逐渐瓦解。当年的12月，红色高棉的主要领导人向柬埔寨王国政府投降，并且供述出三面佛像这尊国宝的下落——位于泰柬边境的遗迹圣人窟。
      得知此消息后，富豪收藏家弗洛雷斯请来了中国九华山天台寺的高僧释彻己牵头，又组织了你们这一批专业人士去圣人窟取回三面佛像。由于依旧有红色高棉残党在附近顽抗不休，他还请来了柬埔寨王国的著名军官克鲁兹上校作为小队的总负责。
      1999年3月4日下午五点许，你们一行七人先后来到了圣人窟东面的“圣佛寺”汇合。
      `,
    requirements:
    {
      weapon: "1d8以下的手枪或者1d10以下的冷兵器，除非特别说明。",
      build: "购点530",
      special: [
        "具体的秘密和特殊信息请私聊kp。"
      ]
    },
    tags: ["COC", "模组", "第二世界", "东亚", "高棉", "秘密团", "文字团", "PVP"],
    year: 1996
  },
  {
    id: 12,
    title: "高棉巨蛇",
    author: "秀林生、狸十二",
    description: "第二世界-高棉系列2",
    estimatedTime: "11-16小时",
    authorWords:
      `佛非佛，道非道，三山符箓一花禅。咦？五叶树下我非我。`,
    background:
      `1999年12月，年关将至。在不到六十个小时内，全世界都将迎来一个新的世纪。而在这个重要的时刻，柬泰两国边境处的丛林却绝对称不上宁静。虽然被称为红色高棉的恐怖组织残党已经几乎被剿灭，但是却依旧时不时地有人失踪。蛇妖、怨鬼、毒贩、河神、军队实验、红色高棉、变态杀人魔，各种流言层出不穷。出于各种原因，你们冒着连续数日的倾盆大雨在29日傍晚来到了柬埔寨丛林中的这个只有三十余户的边境村庄奥斯姆，租住在村民陈金达开设的乡村招待所里过夜。而再一次睁眼，你就将与一群怪胎一起在这个村子里遭遇意想不到的危机……
`,
    requirements:
    {
      weapon: "1d10及以下，除非为之前本中的战利品。",
      build: "购点530",
      special: [
        "建议技能：梵语。"
      ]
    },
    tags: ["COC", "模组", "第二世界", "东亚", "高棉"],
    year: 1999
  },
  {
    id: 13,
    title: "冰封布勒兹",
    author: "狸十二、秀林生",
    description: "第二世界-高棉系列2",
    estimatedTime: "6-12小时",
    authorWords:
      `冰冻三尺，非一日之寒。`,
    background:
      `芬兰作为圣诞老人的故乡，素以极北的美景与淳朴的民风著称。而其境内的一座小村庄布勒兹则是以其特有的“人骨教堂”闻名一方。据说那是一座建造于公元13世纪，完全由人骨打造的教堂，经历了近千年的战火和风雪保存至今，是极罕见的人文奇观。虽然有许多人指责宣传这座教堂就是在变相宣扬残忍的扭曲价值观，但不可否认的是，它带动着整座村庄的旅游业发展。1999年12月21日，你们一行人抵达了罗凡涅米火车站，等待着前往布勒兹的carpool，期待着一览人骨教堂的风采……
      `,
    requirements:
    {
      weapon: "最大伤害14及以下的非自动武器，除非为之前本中的战利品。",
      build: "购点530",
      special: [
        "高掉san，高撕卡率。部分剧情需玩家主动探索。愚人节特供剧本。"
      ]
    },
    tags: ["COC", "模组", "第二世界", "高撕卡率", "愚人节", "单篇"],
    year: 1999
  },
  {
    id: 14,
    title: "草鬼发蛊",
    author: "秀林生、狸十二",
    description: "第二世界-单篇",
    estimatedTime: "11-15小时",
    authorWords:
      `多情少女无情蛊，又见良人陷作贼。`,
    background:
      `蛊术源远流长，早在战国时期便有记载。自秦汉隋唐以来，随着中原与西南民族的交往渐多，苗疆蛊术也逐渐出现在了大众的视野中，并由于各种加工与演绎而愈发令人生畏。然而在科学技术的发展之下，大部分的蛊术都被归结于寄生虫与中毒，逐渐被揭开了原本神秘的面纱。2015年6月21日，出于各自的目的，你们与一名名为【明德守信】的网友约定一同驱车前往滇南边境的苗家村寨“归漕村”进行两天两夜的旅行，参加苗族的特色节日【花山节】。据说若是在这花山节的比赛中获得胜利，就可以获得苗家少女的芳心。
`,
    requirements:
    {
      weapon: "最大伤害10及以下，除非为之前本中的战利品。携带枪支均需KP特殊批准。",
      build: "购点530",
      special: [
        "秀林生推荐技能：苗语、药学、法律。",
        "狸十二推荐技能：唱歌、跳舞、爬杆子。"
      ]
    },
    tags: ["COC", "模组", "第二世界", "东亚", "单篇"],
    year: 2015
  },
  {
    id: 15,
    title: "千岛遗珠",
    author: "秀林生、狸十二",
    description: "第二世界-单篇",
    estimatedTime: "7-11小时",
    authorWords:
      `我寻，我行，我迷途。我闻，我阅，我视界。`,
    background:
      `作为枫叶国的母亲河，圣劳伦斯河从来不是什么温润平和的慈母。曾几何时，那位于金士顿旁的千岛湖所代表的并非是一千座浮水而出的美景，而是隐藏着的三千、四千、上万的危险礁石。在1959年枫叶国和星条国合力修建航线之前，这条通往北美内陆心脏的大河早已经不知吞没了多少船只，又不知有多少白骨和秘密被深埋河底。如今航道开通，水势渐缓，那沉没的宝藏却又吸引着无数寻宝者和潜水爱好者前来一探先辈的遗产。
      前日，户外探险博主【米西·吉尔摩】说起一艘罕为人知的游轮【米卡科内】曾经在圣劳伦斯河内的千岛湖中沉没。你们作为被她抽到的幸运观众，受邀来此参加她对于米卡科内的潜水探险活动。
      2021年5月28日，你们一起相约来到了圣劳伦斯河边的无名码头，准备搭上米西·吉尔摩的小艇，一同前往她所租借的小岛上的小屋歇脚。
      `,
    requirements:
    {
      weapon: "最大伤害10及以下，除非为之前本中的战利品。",
      build: "购点530",
      special: [
        "KP推荐技能：游泳、潜水"
      ]
    },
    tags: ["COC", "模组", "第二世界", "北美", "单篇"],
    year: 2021
  },
  {
    id: 16,
    title: "长安未安",
    author: "狸十二、秀林生",
    description: "第三世界-天朝帝国-等级1",
    estimatedTime: "13-28小时",
    authorWords:
      `盛世长安梦里求，谁家春色泪空流。`,
    background:
      `公元1991年，清统16年，三月十五，长安城中，春花烂漫。
      距离祸乱朝纲的“长安之乱”已经过去了16年；距离天朝毅宗庄成皇帝驾崩已经过去了22年；距离“神威无敌破军安汉荡寇历烽镇远护国大将军炮”首次使用已经过去了46年；距离庄成皇帝颁布《谕万国人类诏》开启十年战争，甚至都已经过去了60年。
      在天朝帝国的腹地里，除了一些老者，已经没什么人还记得当年那种人类的生死存亡系于一线的恐怖了。你们来自天朝各处，因为各种不同的原因来到了天朝的第二首都长安城，准备在长安的一所知名旅馆“未央坊”下榻。而未央坊吸引住客所靠的可并不只是旅馆这一个招牌，还有，位于未央坊后院里的一间国营青楼“未央阁”。
      据说那未央阁的花魁乃是天下第一的美人，一笑便足以倾城倾国，却也不像普通的青楼女子般容易得见。别说与她共度良宵，就是见上花魁一面，也须得是诗词歌赋文采斐然、歌舞琴棋才艺风流、相貌堂堂丰神俊朗、衣冠楚楚名门富室四条尽皆满足之人。也是因此，长安远近风雅人物皆以一见花魁为荣。
      春花烂漫，轻烟袅袅，好个盛世。
      `,
    requirements:
    {
      weapon: "最大伤害10；非军方/警方枪械伤害小于等于8",
      build: "购点530",
      special: [
        "未央坊每日住宿150+，包早饭，不包含午晚饭和其他任何娱乐项目",
        "信用评级≤80，在政府和军方不得为从九品以上职位，50及以上不能和政府或军方有任何关系",
        "生活体验本，世界观引入，侧重玩家层面推理",
        "玩家不能是长安本地人，请为自己想好一个在未央坊中下榻的理由",
        "沙盒模拟，游戏时长取决于玩家操作。如果只希望体验核心剧情，请通知KP"
      ]
    },
    tags: ["COC", "模组", "第三世界", "天朝帝国", "等级1", "长安", "引入", "沙盒"],
    year: 1991
  },
  {
    id: 17,
    title: "赤血回煞",
    author: "狸十二、秀林生",
    description: "第三世界-天朝帝国-等级2",
    estimatedTime: "9-10小时",
    authorWords:
      `轻烟半两千金掷，一鼎混元万岁秋。`,
    background:
      `公元1991年，清统16年，三月十七，长安城中，喧嚣未散……`,
    requirements:
    {
      weapon: "最大伤害10；非军方/警方枪械伤害小于等于8",
      build: "购点530",
      special: [
        "信用评级≤80，在政府和军方不得为从九品以上职位，50及以上不能和政府或军方有任何关系",
        "生活体验本，世界观引入，侧重玩家层面推理",
        "沙盒模拟，游戏时长取决于玩家操作。如果只希望体验核心剧情，请通知KP"
      ]
    },
    tags: ["COC", "模组", "第三世界", "天朝帝国", "等级2", "长安", "引入", "沙盒"],
    year: 1991
  },
  {
    id: 18,
    title: "天府桃源",
    author: "狸十二、秀林生",
    description: "第三世界-天朝帝国-等级2",
    estimatedTime: "8-11小时",
    authorWords:
      `春来遍是桃花水，不辨仙源何处寻。`,
    background:
      `公元1930年，一直在雪山中蛰伏的类人种族丘丘人趁着大乱走上台前，在吐蕃建立了吐蕃第三王国。同年，被称为“蛇妖恶孽”的蛇人和蜥蜴人也从东南亚的地下涌出，打着“复兴古南禺国”的旗号混入人类之中，建立了莱帕栖南禺国。不过他们的算盘中，都忽视了那名也是在这一年继位的天朝皇帝。两年后，公元1932年，天朝毅宗庄成帝发表“谕万国人类诏”，开启十年战争。公元1936年，天朝帝国大败吐蕃第三王国，丘丘人称臣纳贡，以天朝为宗主国，接受天朝所设立吐蕃都护府的羁縻统治。公元1940年，天朝发动“征南奇役”，攻陷莱帕栖南禺国首都。莱帕栖南禺国灭亡后，东南亚亦接受天朝设立的都护府统治。从此，天朝帝国正式树立了在整个东亚无可争议的人类强势统治。五十多年后，这份强权中却产生了一丝涟漪。
      公元1993年，清统18年，吐蕃第三王国驻长安的大使贩卖违禁魔法药物之事被发现，并且牵连了一批礼部的官员落马。天朝扣留全部丘丘人使团，派遣礼部官员出使吐蕃进行责问。与此同时，帝国也派出了一批巡视组前往天朝西南面的各州巡视，以配合此次责问的造势。二月，扬威大将军（四品）李起云率军屯兵于吐蕃、益州、宁州三地接壤的巴康县，以备吐蕃异动。
      闰三月初七，你们离开了重兵镇守的镇南成都都督府，进入了巴康县的境内。在这一片高原晚春的艳丽桃花之中，你们驶入了一个名为“桃溪村”的小村庄稍稍歇脚……
      `,
    requirements:
    {
      weapon: "最大伤害10+2护甲，非军方/警方枪械伤害小于等于8，除非为之前本中的战利品。",
      build: "购点530",
      special: [
        "信用评级≤80，在政府和军方不得为从九品以上职位。",
        "若为官方人员，可与一支巡视小组先遣队一同前来。请与KP私聊了解同行人员。其他人员请为自己想好一个在桃溪村留宿的理由和来此的目标。",
        "世界观引入，侧重玩家层面决策。"
      ]
    },
    tags: ["COC", "模组", "第三世界", "天朝帝国", "等级2", "引入"],
    year: 1993
  },
  {
    id: 19,
    title: "蛇影幽谧",
    author: "秀林生、狸十二",
    description: "第三世界-天朝帝国-等级3",
    estimatedTime: "10-11小时",
    authorWords:
      `自谓经过旧不迷，安知峰壑今来变。`,
    background:
      `公元1930年，被称为“蛇妖恶孽”的蛇人从东南亚的地下涌出，打着“复兴古南禺国”的旗号混入人类之中，建立了莱帕栖南禺国，并定都于“吴哥城”。公元1940年，天朝发动“征南奇役”，攻陷吴哥城，一举摧毁了莱帕栖南禺国的主要政治和军事力量，随即设置了诸多都护府以进行羁縻统治。
      不过90年代中叶，天朝在东南亚一带的强权却已经产生了一丝动摇。蛊惑人心的邪教和毒品军火的走私愈发猖獗，严重渗透到了相邻的宁州、交州等天朝直属的郡县之中，甚至有谣言称邪教和走私团伙与几大都护府中的官员也有勾结。为了彻查东南亚各个都护府中的犯罪活动，天朝派出了无数巡视小队开始检察其治下的各个村落。在这敏感的时刻，每个人的神经都绷到了极限，蛇妖、怨鬼、毒贩、河神、军队实验、变态杀人魔，各种流言层出不穷。
      出于各种原因，你们在1995年十月十四日的午后来到了高棉都护府与暹罗都护府交界处，一个只有三十余户的边境村庄【奥斯姆】，预定了村民【陈金达】所开设的乡村招待所。然而，正是在这里，你们将展开一段意想不到的旅程，探索这个看似平凡的村庄中隐藏的秘密。
      `,
    requirements:
    {
      weapon: "10武器+4护甲，非军方/警方枪械伤害小于等于8，除非为之前本中的战利品。",
      build: "购点540",
      special: [
        "信用评级≤80，在政府和军方不得为从九品以上职位。",
        "若为官方人员，可与一支巡视小组先遣队一同前来。请与KP私聊了解同行人员。其他人员请为自己想好一个来此的目标，不可以是奥斯姆村本地人。",
        "战斗强度稍大。"
      ]
    },
    tags: ["COC", "模组", "第三世界", "天朝帝国", "等级3", "高棉"],
    year: 1995
  },
  {
    id: 20,
    title: "水影迷踪",
    author: "秀林生、狸十二",
    description: "第三世界-天朝帝国-等级3",
    estimatedTime: "6-12小时",
    authorWords:
      `碧水长波现柳芒，不知菊烬落残霜。`,
    background:
      `公元1941年。天朝发动“静谧计划”，假装放弃整个东亚海岸，吸引在全球海域内猖獗的鱼妖恶孽登陆。第二年，天朝镇东军在鱼妖恶孽大范围登陆后以陆军发起歼灭战，剿灭了近十万的鱼妖恶孽和邪教徒，史称“血色海岸”，一举扭转了人类面对鱼妖恶孽的被动防守态势。不过即使损失惨重，鱼妖恶孽却依旧没有停止他们进犯陆地的阴谋。为了更好地扫荡沿海的鱼妖恶孽，天朝在江都设立了镇东都督府，使徐州成为了唯一一个始终处于战争状态的都督府军区。1997年二月三日，你们的小队被征集，在徐州的淮南市青山镇追寻一组从洛阳出发的机密文件的下落……
`,
    requirements:
    {
      weapon: "10武器+4护甲，非军方/警方枪械伤害小于等于8，除非为之前本中的战利品。",
      build: "购点540",
      special: [
        "信用评级≤80，在政府和军方不得为正九品以上职位。",
        "角色必须为【蛇影幽谧】中的立功成员，或政府人员。",
        "战斗强度稍大，需要一定推理。"
      ]
    },
    tags: ["COC", "模组", "第三世界", "天朝帝国", "等级3",],
    year: 1997
  },
  {
    id: 21,
    title: "东海巨缁",
    author: "秀林生、狸十二",
    description: "第三世界-天朝帝国-等级5",
    estimatedTime: "7-10小时",
    authorWords:
      `双雕内外谋奇智，一刃诛魔震五洋。`,
    background:
      `公元1941年。天朝发动“静谧计划”，假装放弃整个东亚海岸，吸引在全球海域内猖獗的鱼妖恶孽登陆。第二年，天朝镇东军在鱼妖恶孽大范围登陆后以陆军发起歼灭战，剿灭了近十万的鱼妖恶孽和邪教徒，史称“血色海岸”，一举扭转了人类面对鱼妖恶孽的被动防守态势。不过即使损失惨重，鱼妖恶孽却依旧没有停止他们进犯陆地的阴谋。1999年九月八日，你们的小队随军前往了东海中的岛屿“钓鱼岛”，准备清缴在彼处登陆的鱼妖恶孽。
      `,
    requirements:
    {
      weapon: "14武器（征东军武器库临时支取）+4护甲，除非为之前本中的战利品。",
      build: "购点550",
      special: [
        "新卡信用评级≤80，必须为扶桑府/军方成员，不得为正九品以上职位。",
        "角色必须为【水影迷踪】中的立功成员，或政府人员。",
        "战斗强度极大、高掉san原作向。"
      ]
    },
    tags: ["COC", "模组", "第三世界", "天朝帝国", "等级5", "原作向", "高撕卡率"],
    year: 1999
  }
];

export const getLastCOCModules = (count = 3) => {
  return COC_modules.slice(Math.max(COC_modules.length - count, 0));
};
export const getCOCModulesById = (id) => {
  return COC_modules.find(module => module.id === parseInt(id));
};

export const getCOCModulesByTag = (tag) => {
  return COC_modules.filter(module => module.tags.includes(tag));
};
